Repository: JcDenis/improve
Catalog: locales/*/main.po
Languages: fr

source: List of disabled tasks
fr: Listes des tâches désactivées

source: Hide details of rendered tasks
fr: Ne pas afficher le rendu des tâches

source: Show dotclear distributed modules
fr: Afficher les modules de la distribution Dotclear

source: Sort modules seletion by:
fr: Trier la sélection de modules par :

source: Begin
fr: Début

source: Module path is not writable
fr: Le chemin du module n'est pas accessible en écriture

source: File content has been removed: %s by %s
fr: Le contenu du fichier a été supprimé : %s par %s

source: End
fr: Fin

source: No tasks selected
fr: Aucune tâche sélectionnée

source: No module selected
fr: Aucun module sélectionné

source: Fix of "%s" complete in %s secondes with errors
fr: Fixe de "%s" complété en %s secondes avec des erreurs

source: Fix of "%s" complete in %s secondes with warnings
fr: Fixe de "%s" complété en %s secondes avec des avertissements

source: Fix of "%s" complete in %s secondes
fr: Fixe de "%s" complété en %s secondes

source: Fix of "%s" complete in %s secondes without messages
fr: Fixe de "%s" complété en %s secondes sans message

source: Themes tasks
fr: Tâches des thèmes

source: Plugins tasks
fr: Tâches des plugins

source: Configure module
fr: Configurer le module

source: Unknow task
fr: Tâche inconnue

source: Configure task "%s"
fr: Configurer la tâche "%s"

source: Nothing to configure
fr: Rien à configurer

source: Themes
fr: Thèmes

source: No module to manage
fr: Aucun module à gérer

source: List of available tasks
fr: Listes des tâches disponibles

source: Task
fr: Tâches

source: Priority
fr: Priorité

source: Configure task '%s'
fr: Configurer la tâche "%s"

source: Configure
fr: Configurer

source: Save fields selection as preference
fr: Enregistrer la sélection comme préférence

source: Select a module:
fr: Sélectionner un module :

source: Fix it
fr: Corriger

source: Select a module
fr: Sélectionner un module

source: CSS header
fr: Entête de fichier CSS

source: Add or remove phpdoc header bloc from css file
fr: Ajouter ou supprimer les bloc d'entête phpdoc des fichiers css

source: Do nothing
fr: Ne rien faire

source: Add bloc if it does not exist
fr: Ajouter les blocs si ils n'existent pas déjà

source: Add and overwrite bloc
fr: Ajouter et écraser les blocs

source: Overwrite bloc only if it exists
fr: Ecraser les blocs seulement si ils existent

source: Remove existing bloc header
fr: Retirer les blocs d'entête existant

source: Adjustments
fr: Ajustements

source: Do not add bloc to files from "locales" and "libs" folder
fr: Ne pas ajouter les blocs d'entête aux fichiers des répertoires "locales" et "libs"

source: Do not add bloc to files from "tpl" and "default-templates" folder
fr: Ne pas ajouter les blocs d'entête aux fichiers des répertoires "tpl" et "default-templates"

source: Contents
fr: Contenu

source: Bloc content:
fr: Contenu du bloc :

source: You can use wildcards %s
fr: Vous pouvez utiliser les jokers suivants : %s.

source: Do not put structural elements to the begining of lines.
fr: Ne pas mettre d'élément de structure en début de ligne

source: bloc is empty
fr: le bloc est vide

source: Prepare header info
fr: Préparer les informations d'entête

source: Failed to parse bloc
fr: Impossible de préparer le bloc

source: Skip directory
fr: Ignorer le répertoire

source: Write new doc bloc content
fr: Ecrire le nouveau contenu de bloc

source: Delete old doc bloc content
fr: Effacer l'ancien contenu de type phpdoc

source: Dotclear deprecated
fr: Dépréciés de Dotclear

source: Search for use of deprecated Dotclear functions
fr: Recherche l'utilisation de fonctions dépréciées de Dotclear

source: Possible use of deprecated "%s", you should use "%s" instead since Dotclear %s.
fr: Possible utilisation du déprécié "%s", vous devriez utiliser "%s" à la place depuis Dotclear %s.

source: Help
fr: Aide

source: Store file
fr: Fichier de dépôt

source: Re-create dcstore.xml file according to _define.php variables
fr: Re-créer le fichier dcstore.xml suivant les variables du fichier _define.php

source: File will be overwritten if it exists
fr: Le fichier sera réécrit si il existe

source: Predictable URL to zip file on the external repository:
fr: URL prédictive du fichier zip sur le dépôt externe :

source: For exemple on github https://github.com/MyGitName/%id%/releases/download/v%version%/%type%-%id%.zip
fr: Par exemple sur github https://github.com/MyGitName/%id%/releases/download/v%version%/%type%-%id%.zip

source: Note on github, you must create a release and join to it the module zip file.
fr: Note sur Github, vous devez créer un release et y joindre le fichier zip du module.

source: Write dcstore.xml file.
fr: Ecrire le fichier dcstore.xml

source: Failed to write dcstore.xml file
fr: Impossible d'écrire le fichier dcstore.xml

source: unknow module name
fr: nom du module inconnu

source: unknow module version
fr: version du module inconnue

source: unknow module author
fr: auteur du module inconnu

source: unknow module description
fr: description du module inconnue

source: no repository set in _define.php
fr: Aucun dépôt défini dans le fichier _define.php

source: no zip file pattern set in configuration
fr: Pas de modèle de fichier zip présent dans la configuration

source: no minimum dotclear version
fr: pas de version minimum de Dotclear

source: no details URL
fr: Lien de détail non défini

source: no support URL
fr: Lien de support non défini

source: End of files
fr: Fin de fichiers

source: Remove php tag and empty lines from end of files
fr: Supprimer le tag PHP et les lignes vides de fin de fichiers

source: Add a blank line to the end of file
fr: Ajouter une ligne vide en fin de fichier

source: PSR2 must have a blank line, whereas PSR12 must not.
fr: PSR2 doit avoir une ligne vide, alors que PSR12 non.

source: Replace end of file
fr: Remplacer les fins de fichiers

source: Shields badges
fr: Badges Shields.io

source: Add and maintain shields.io badges to the REDAME.md file
fr: Ajoute et maintient à jour les badges shields.io du fichier README.md

source: Your Github user name:
fr: Votre "username" Github :

source: Used in your Github URL: http://github.com/username/module_id.
fr: Utilisé dans l'URL Github tel que : http://github.com/username/module_id.

source: If you have badges not created by this tool in the README.md file you should remove them manually.
fr: Si vous avez déjà des badges non créés par cet outil, vous devrez les retirer manuellement.

source: Include Dotaddict badge
fr: Inclure le badge Dotaddict

source: If your plugin or theme is on Dotaddict, you can add a badge to link to its details in Dotaddict.
fr: Si votre plugin ou theme est sur Dotaddict, vous pouvez ajouter un badge lier à ses détails sur DA.

source: Prepare custom shield info
fr: préparer les informations personnalisées

source: Write new shield bloc
fr: Ecrire le nouveau bloc Shield

source: Delete old shield bloc
fr: Effacer l'ancine bloc Shield

source: License file
fr: Fichier de licence

source: Add or remove full license file to module root
fr: Ajoute ou supprime le fichier de licence

source: no version selected
fr: aucune version selectionnée

source: Add file if it does not exist
fr: Ajouter le fichier si il n'existe pas

source: Add file even if it exists
fr: Ajouter le fichier même si il existe

source: Add file and remove others
fr: Ajouter la nouvelle licence et supprimer les autres

source: Remove license files
fr: Supprimer les fichiers de licence

source: License version:
fr: Version de la licence :

source: Action on file:
fr: Action sur le fichier :

source: No full license type selected
fr: Pas de type de licence seletionné

source: Failed to load license content
fr: Impossible de charger le contenu de la licence

source: Write new license file "LICENSE"
fr: Écrire le nouveau fichier "LICENSE" de licence

source: Failed to write new license file
fr: Impossible d'écrire le nouveau fichier de licence

source: Old license file is not deletable (%s)
fr: L'ancien fichier de licence n'est pas supprimable (%s)

source: Failed to delete old license file (%s)
fr: Impossible de supprimer l'ancien fichier de licence (%s)

source: Delete old license file "%s"
fr: Effacer l'ancien fichier de Licence "%s"

source: Newlines
fr: Retour à la ligne

source: Replace bad and repetitive and empty newline by single newline in files
fr: Remplace les mauvais ou répétitifs retour à la ligne par une seule nouvelle ligne

source: List of files extension to work on:
fr: Liste des extensions de fichier à corriger:

source: Use comma separated list of extensions without dot, recommand "php,js,xml,txt,md".
fr: Utiliser une liste d'extensions séparé par des virgules et sans le point, recommandation: "php,js,xml,txt,md".

source: Replace bad new lines
fr: Remplacer les retours à la ligne

source: Fix PSR coding style using Php CS Fixer
fr: Corrige le style du code suivant les règles PSR en utilisant Php CS Fixer

source: Root
fr: Racine

source: Root directory of PHP executable:
fr: Chemin complet du répertoire de l'exécutable PHP :

source: If this module does not work you can try to put here directory to php executable (without executable file name).
fr: Si ce module ne fonctionne pas vous pouvez tenter de mettre ici le chemin complet du répertoire de l'exécutable PHP (sans le nom de fichier exécutable).

source: PHP CS Fixer configuration file:
fr: Fichier de configuration de PHP CS Fixer :

source: Failed to run php-cs-fixer
fr: Impossible d'exécuter php-cs-fixer

source: PHP header
fr: Entête de fichier PHP

source: Add or remove phpdoc header bloc from php file
fr: Ajouter ou supprimer les bloc d'entête phpdoc des fichiers php

source: Remove old style bloc header (using #)
fr: Supprimer les bloc d'entête ancien (utilisant #)

source: Delete old style bloc content
fr: Effacer l'ancien contenu de type ancien

source: Analyse php code using PHPStan
fr: Analyse le code PHP en utilisant PHPStan

source: You must enable improve details to view analyse results !
fr: Pour voir les résultats d'analyse, vous devez activer l'affichage des détails dans les paramètres d'improve.

source: Level:
fr: Niveau :

source: List of ignored variables:
fr: Listes des variables ignorées :

source: If you have errors like "%s", you can add this var here. Use ; as separator and do not put $ ahead.
fr: Si vous avez des erreurs comme "%s", vous pouvez ajouter ces variables ici. Utiliser ; comme séparateur et ne pas mettre $ devant.

source: For exemple: var;_othervar;avar
fr: Par exemple: var;othervar;avar

source: Some variables like core, _menu, are already set in ignored list.
fr: Certaines variables comme core, _menu, ... sont déjà dans la liste des variables ignorées.

source: Do not use rules from default ignored errors list.
fr: Ne pas utiliser les règles de la liste des erreurs ignorées

source: See ignored errors from configuration file below.
fr: Voir la liste des erreurs ignorées dans le fichier de configuration ci-dessous.

source: Split report by file rather than all in the end.
fr: Scinder le rapport par fichier plutôt qu'un seul à la fin.

source: Enable this can cause timeout.
fr: Activer ceci peut causer de Timeout.

source: Clear result cache before each analizes.
fr: Effacer le cache de résultat à chaque analyse.

source: PHPStan configuration file:
fr: Fichier de configuration de PHPStan :

source: Failed to write phpstan configuration
fr: Impossible d'écrire la configuration de PHPStan

source: Cache cleared
fr: Cache effacé

source: No errors found
fr: Aucune erreur trouvé

source: Failed to run phpstan
fr: Impossible d'exécuter PHPStan

source: Translation files
fr: Fichier de traductions

source: Compile existing translation .po files to fresh .lang.php files
fr: Compile les fichiers de traductions .po existants en fichiers compilés .lang.php

source: Compile .po file to .lang.php
fr: Fichier .po compilé en .lang.php

source: Failed to compile .po file
fr: Impossible de compiler le fichier .po

source: Replace tabulation by four space in php files
fr: Remplace les tabulation par quatre espaces dans les fichiers php

source: Replace tabulation by spaces
fr: Remplacer les tabulations

source: Zip module
fr: Zipper le module

source: Compress module into a ready to install package
fr: Compresser le module en un paquetage prêt à installer

source: Path to repository:
fr: Chemin vers le dépôt :

source: Preconization: %s
fr: Préconisation : %s

source: Blog's public directory
fr: Répertoire public du blog

source: Files
fr: Fichiers

source: Name of exported package:
fr: Nom du paquetage exporté :

source: Name of second exported package:
fr: Nom du second paquetage exporté :

source: Overwrite existing languages
fr: Ecraser les langues existantes

source: Extra files to exclude from package:
fr: Fichiers supplémentaires à exclure du paquetage :

source: By default all these files are always removed from packages : %s
fr: Pas défaut tous ces fichiers sont toujours exclu des paquetages : %s

source: Remove comments from files
fr: Retirer les commentaires des fichiers

source: Prepare excluded files "%s"
fr: Préparer les fichiers à exclure "%s"

source: Prepare comment removal
fr: Préparer le retrait des commentaires

source: Destination filename already exists
fr: Le fichier de destination existe déjà

source: Destination path is not writable
fr: Le répertoire de destination n'est pas accessible en écriture

source: Zip module into "%s"
fr: Zipper le module vers "%s"

source: Tiny tools to fix things for module devs
fr: Outils simple pour aider les développeurs à fignoler leurs modules
